Tekla Open API Reference for Tekla Structures 2025
Integer.Equals Method
 Returns a value that indicates whether the current instance is equal to the given object.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object Obj
)
Public Overrides Function Equals (
	Obj As Object
) As Boolean
Parameters
Obj
Type: System.Object
The object to be used for comparing.
Return Value
Type: Boolean
True if the given object has the same value as the current instance.
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace